In [1]:
import pandas as pd

In [2]:
inventory = pd.read_csv('O:/Northwood/Capstone/bookstore_datasets/bookstore_inventory.csv')
inventory.head()

,month,from,to,sku,qty,unit_cost,unit_price,extended_cost,extended_retail,dataset
0,2019-01-01,YYC-WH,YYC-DT,BK1000,19,8.09,18.92,153.71,359.48,bookstore_inventory
1,2019-01-01,YYC-WH,YYC-NW,BK1000,10,8.09,18.92,80.90,189.20,bookstore_inventory
2,2019-01-01,YYC-WH,YYC-SE,BK1000,7,8.09,18.92,56.63,132.44,bookstore_inventory
3,2019-01-01,YYC-WH,YYC-DT,BK1001,21,10.75,24.49,225.75,514.29,bookstore_inventory
4,2019-01-01,YYC-WH,YYC-NW,BK1001,13,10.75,24.49,139.75,318.37,bookstore_inventory

In [3]:
sales_data = pd.read_csv('O:/Northwood/Capstone/bookstore_datasets/bookstore_sales.csv')
sales_data.head()

,date,year,month,store_id,channel,transactions,revenue,gst_collected,net_revenue,dataset
0,2019-01-01,2019,1,YYC-DT,IN_STORE,64,1985.46,99.27,1886.19,bookstore_sales
1,2019-01-01,2019,1,YYC-DT,ONLINE,8,207.72,10.39,197.33,bookstore_sales
2,2019-01-01,2019,1,YYC-NW,IN_STORE,49,1466.95,73.35,1393.60,bookstore_sales
3,2019-01-01,2019,1,YYC-NW,ONLINE,4,148.89,7.44,141.45,bookstore_sales
4,2019-01-01,2019,1,YYC-SE,IN_STORE,33,1272.70,63.64,1209.06,bookstore_sales

In [4]:
print(inventory.shape)
print(sales_data.shape)

(21566, 10)
(13152, 10)

In [5]:
inventory.describe()

,qty,unit_cost,unit_price,extended_cost,extended_retail
count,21566.000000,21566.000000,21566.000000,21566.000000,21566.000000
mean,13.607020,12.380085,26.323480,168.395885,358.156324
std,6.483232,3.528916,7.857572,95.771328,206.848009
min,1.000000,6.080000,11.510000,6.270000,11.510000
25%,9.000000,9.120000,18.920000,98.100000,205.380000
50%,13.000000,13.110000,27.050000,150.100000,320.400000
75%,17.000000,15.360000,31.930000,219.167500,467.210000
max,52.000000,17.770000,42.690000,703.560000,1664.910000

In [6]:
sales_data.describe()

,year,month,transactions,revenue,gst_collected,net_revenue
count,13152.000000,13152.000000,13152.000000,13152.000000,13152.000000,13152.000000
mean,2021.500456,6.521898,32.601125,1051.288171,52.564473,998.723698
std,1.708246,3.449117,24.465208,762.231707,38.111537,724.120169
min,2019.000000,1.000000,3.000000,83.830000,4.190000,79.640000
25%,2020.000000,4.000000,12.000000,409.035000,20.450000,388.585000
50%,2021.500000,7.000000,24.000000,780.325000,39.020000,741.305000
75%,2023.000000,10.000000,49.000000,1586.855000,79.342500,1507.512500
max,2024.000000,12.000000,154.000000,4279.490000,213.970000,4065.520000

In [7]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13152 entries, 0 to 13151
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           13152 non-null  object
 1   year           13152 non-null  int64
 2   month          13152 non-null  int64
 3   store_id       13152 non-null  object
 4   channel        13152 non-null  object
 5   transactions   13152 non-null  int64
 6   revenue        13152 non-null  float64
 7   gst_collected  13152 non-null  float64
 8   net_revenue    13152 non-null  float64
 9   dataset        13152 non-null  object
dtypes: float64(3), int64(3), object(4)
memory usage: 1.0+ MB

In [8]:
inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21566 entries, 0 to 21565
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   month            21566 non-null  object
 1   from             21566 non-null  object
 2   to               21566 non-null  object
 3   sku              21566 non-null  object
 4   qty              21566 non-null  int64
 5   unit_cost        21566 non-null  float64
 6   unit_price       21566 non-null  float64
 7   extended_cost    21566 non-null  float64
 8   extended_retail  21566 non-null  float64
 9   dataset          21566 non-null  object
dtypes: float64(4), int64(1), object(5)
memory usage: 1.6+ MB

In [9]:
print(sales_data.dtypes)

date              object
year               int64
month              int64
store_id          object
channel           object
transactions       int64
revenue          float64
gst_collected    float64
net_revenue      float64
dataset           object
dtype: object

In [10]:
sales_data['date'] = pd.to_datetime(sales_data['date'], format = "%Y-%m-%d")
print(sales_data.dtypes)

date             datetime64[ns]
year                      int64
month                     int64
store_id                 object
channel                  object
transactions              int64
revenue                 float64
gst_collected           float64
net_revenue             float64
dataset                  object
dtype: object

In [11]:
sales_data["date"] = sales_data["date"].dt.to_period("M")

In [12]:
sales_data.head()

,date,year,month,store_id,channel,transactions,revenue,gst_collected,net_revenue,dataset
0,2019-01,2019,1,YYC-DT,IN_STORE,64,1985.46,99.27,1886.19,bookstore_sales
1,2019-01,2019,1,YYC-DT,ONLINE,8,207.72,10.39,197.33,bookstore_sales
2,2019-01,2019,1,YYC-NW,IN_STORE,49,1466.95,73.35,1393.60,bookstore_sales
3,2019-01,2019,1,YYC-NW,ONLINE,4,148.89,7.44,141.45,bookstore_sales
4,2019-01,2019,1,YYC-SE,IN_STORE,33,1272.70,63.64,1209.06,bookstore_sales

In [13]:
new_sales = sales_data [["date", 'store_id', 'transactions', 'revenue', 'gst_collected', 'net_revenue']]
print(new_sales)

          date store_id  transactions  revenue  gst_collected  net_revenue
0      2019-01   YYC-DT            64  1985.46          99.27      1886.19
1      2019-01   YYC-DT             8   207.72          10.39       197.33
2      2019-01   YYC-NW            49  1466.95          73.35      1393.60
3      2019-01   YYC-NW             4   148.89           7.44       141.45
4      2019-01   YYC-SE            33  1272.70          63.64      1209.06
...        ...      ...           ...      ...            ...          ...
13147  2024-12   YYC-DT            16   651.08          32.55       618.53
13148  2024-12   YYC-NW            90  2489.90         124.50      2365.40
13149  2024-12   YYC-NW            18   507.71          25.39       482.32
13150  2024-12   YYC-SE            85  2191.54         109.58      2081.96
13151  2024-12   YYC-SE            10   370.54          18.53       352.01

[13152 rows x 6 columns]

In [14]:
print(inventory.columns)

Index(['month', 'from', 'to', 'sku', 'qty', 'unit_cost', 'unit_price',
       'extended_cost', 'extended_retail', 'dataset'],
      dtype='object')

In [15]:
inventory.rename(columns={'month': 'year_month', 'from': 'warehouse','to':'Store_ID',
                          'extended_cost' : 'total_cost', 'extended_retail':'total_retail'}, inplace=True)

In [16]:
new_inventory = inventory [['year_month', 'warehouse','Store_ID','qty',
                           'unit_cost', 'unit_price','total_cost','total_retail']]

In [17]:
print(new_inventory.columns)

Index(['year_month', 'warehouse', 'Store_ID', 'qty', 'unit_cost', 'unit_price',
       'total_cost', 'total_retail'],
      dtype='object')

In [18]:
new_inventory['year_month'] = pd.to_datetime(new_inventory['year_month'], format = "%Y-%m-%d")

C:\Users\TempPC\AppData\Local\Temp\ipykernel_66280\2565497492.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_inventory['year_month'] = pd.to_datetime(new_inventory['year_month'], format = "%Y-%m-%d")

In [19]:
new_inventory = inventory.rename(columns = {'month': 'year_month',
                                            'from': 'warehouse',
                                            'to': 'Store_ID',
                                            'extended_cost': 'total_cost',
                                            'extended_retail': 'total_retail'
                                            })[['year_month', 'warehouse', 'Store_ID','qty',
                                                'unit_cost','unit_price','total_cost','total_retail']].copy()

In [20]:
new_inventory['year_month'] = pd.to_datetime(new_inventory['year_month'])
new_inventory['year_month'] = new_inventory['year_month'].dt.to_period('M')

In [21]:
print(new_inventory.dtypes)
print(new_sales.dtypes)

year_month      period[M]
warehouse          object
Store_ID           object
qty                 int64
unit_cost         float64
unit_price        float64
total_cost        float64
total_retail      float64
dtype: object
date             period[M]
store_id            object
transactions         int64
revenue            float64
gst_collected      float64
net_revenue        float64
dtype: object

In [22]:
mydata = pd.merge(new_sales, new_inventory, left_on =['date', 'store_id'], 
                  right_on=['year_month', 'Store_ID'], how='left')

In [23]:
mydata = mydata[['date','store_id', 'warehouse','transactions','revenue', 'net_revenue',
                 'qty', 'unit_cost', 'unit_price', 'total_cost', 'total_retail']]
mydata.tail()

,date,store_id,warehouse,transactions,revenue,net_revenue,qty,unit_cost,unit_price,total_cost,total_retail
1313127,2024-12,YYC-SE,YYC-WH,10,370.54,352.01,20,15.10,27.51,302.00,550.20
1313128,2024-12,YYC-SE,YYC-WH,10,370.54,352.01,15,6.30,15.47,94.50,232.05
1313129,2024-12,YYC-SE,YYC-WH,10,370.54,352.01,22,6.27,11.51,137.94,253.22
1313130,2024-12,YYC-SE,YYC-WH,10,370.54,352.01,10,9.88,21.53,98.80,215.30
1313131,2024-12,YYC-SE,YYC-WH,10,370.54,352.01,17,11.86,27.23,201.62,462.91

In [24]:
mydata.set_index('date', inplace=True)
mydata.sort_index(inplace=True)

In [25]:
filter_mydata = mydata.loc['2021':'2024']
filter_mydata.tail()

,store_id,warehouse,transactions,revenue,net_revenue,qty,unit_cost,unit_price,total_cost,total_retail
date,,,,,,,,,,
2024-12,YYC-SE,YYC-WH,10,370.54,352.01,20,15.10,27.51,302.00,550.20
2024-12,YYC-SE,YYC-WH,10,370.54,352.01,15,6.30,15.47,94.50,232.05
2024-12,YYC-SE,YYC-WH,10,370.54,352.01,22,6.27,11.51,137.94,253.22
2024-12,YYC-SE,YYC-WH,10,370.54,352.01,10,9.88,21.53,98.80,215.30
2024-12,YYC-SE,YYC-WH,10,370.54,352.01,17,11.86,27.23,201.62,462.91

In [27]:
filter_mydata.info()

<class 'pandas.core.frame.DataFrame'>
PeriodIndex: 874892 entries, 2021-01 to 2024-12
Freq: M
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   store_id      874892 non-null  object
 1   warehouse     874892 non-null  object
 2   transactions  874892 non-null  int64
 3   revenue       874892 non-null  float64
 4   net_revenue   874892 non-null  float64
 5   qty           874892 non-null  int64
 6   unit_cost     874892 non-null  float64
 7   unit_price    874892 non-null  float64
 8   total_cost    874892 non-null  float64
 9   total_retail  874892 non-null  float64
dtypes: float64(6), int64(2), object(2)
memory usage: 73.4+ MB